#ifndef __LWIP_NET_H__
#define	__LWIP_NET_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "adt_datatype.h"
#include "lwip\ip_addr.h"
#include "lwip\tcpip.h"
#include "lwip\tcp.h"
#include "lwip\api.h"


typedef	struct IpConfig
{
	INT8U 	NetMac[6];				//网络芯片MAC地址
	ip_addr_t stIpAddr;		//IP地址
	ip_addr_t stNetMask;		//子网掩码
	ip_addr_t stGateway;		//网关
}IPCONFIG;



/***********************************************************************************
函 数 名:	SetNetAddr();
函数功能:	设置本机网络IP等相关地址
输入参数:	addr4, addr3, addr2, addr1 对应由高到低的IP地址
			例如:设置IP地址"192.168.0.100"时调用函数应是SetNetAddr(pAddr,192,168,0,100)
			子网掩码,网关地址设置同此类似
输出参数:	无
返回值：	无
创建日期:2011.1.15
创 建 人:xxx
***********************************************************************************/
void SetNetAddr(ip_addr_t *pAddr, INT8U addr4, INT8U addr3, INT8U addr2, INT8U addr1);

/************************************************************************************
*	  LWIP协议中网络设备和任务相关宏定义,不能随意更改,否则会导致网络使用不正常		*
************************************************************************************/

/************************************************************************************
函 数 名:	LWIP_Init();
函数功能:	网络设备和任务起始优先级初始化函数,该函数需在网络初始化时第一个被调用.
输入参数:	eth:			双网卡时，设置默认网卡[ex:0-ETH0 or 1-ETH1]，否置为0即可

			start_prio:		如果配置成单网卡,协议站内部占用2个任务优先级,即 start_prio 和  start_prio+1
							如果配置成双网卡,协议站内部占用3个任务优先级,即 start_prio , start_prio+1  和  start_prio+2
			
			para:			IPCONFIG结构体参数，包含MAC地址,IP,子网掩码,网关等信息
			
			eth_num:		网卡数量：单网卡为1，双网卡为2

输出参数:	无
返回值：	0：初始化正常		-1:芯片未找到	　-2:芯片未被正常初始化
创建日期:
创 建 人:
************************************************************************************/
int LWIP_Init(INT8U net_driver, INT8U start_prio, IPCONFIG para[2], INT8U eth_num);

//获取PHY芯片的LINK STATUS,用以检测当前网络连接状态
//Note:此状态需要网络初始化完成后再作检测
//0-link is down
//1-link is up
int LWIP_LL_LinkStatus(int ethx);

/***********************************************************************************
函 数 名:	LWIPLib_Ver();
函数功能:	获取LWIP库版本号
输入参数:	无
输出参数:	ver:	LWIP库版本
返回值：	无
创建日期:2010.12.14
创 建 人:xxx
***********************************************************************************/
int	LWIPLib_Ver(void);


/***********************************************************************************
函 数 名:	LWIPLib_Name();
函数功能:	获取LWIP库名称
输入参数:	无
输出参数:	name:	LWIP库名称
返回值：	无
创建日期:2010.12.14
创 建 人:xxx
***********************************************************************************/
void 	LWIPLib_Name(INT8S *name);


/***********************************************************************************
函 数 名:	LWIPLib_DateTime();
函数功能:	获取LWIP库编译时间
输入参数:	无
输出参数:	data:	LWIP库编译日期	年/月/日
			time:	LWIP库编译时间	时:分:秒
返回值：	无
创建日期:2010.12.14
创 建 人:xxx
***********************************************************************************/
void	LWIPLib_DateTime(INT8S *date, INT8S *time);

#ifdef __cplusplus
}
#endif

#endif
