#ifndef _E2PROM_H_
#define _E2PROM_H_

#ifdef __cplusplus
extern "C" {
#endif


/*********************************************
 * 函数名：			E2prom初始化
 * 参数：
 * 返回值 :			0 ：成功		-1 ：失败
*********************************************/
int E2prom_Init(void);

/*********************************************
 * 函数名：			E2prom写操作
 * 输入参数：		StartAddr  起始地址
 * 					Bytes      写字节数
 * 					buf        数据保存区
 * 返回值 :			0   - 写失败
 * 					-1  - 参数不正确
 * 					x   - 写成功字节数
 * 备注：		现E2prom存储芯片大小为:16Kbit = 2KByte,故地址范围是:0x00000000 - 0x000007ff
*********************************************/
int E2prom_Write(u32 StartAddr, u8 *buf, u32 Bytes);

/*********************************************
 * 函数名：			E2prom读操作
 * 输入参数：		StartAddr  起始地址
 * 					Bytes      读字节数
 * 					buf        数据保存区
 * 返回值 :			0   - 读失败
 * 					-1  - 参数不正确
 * 					x   - 读成功字节数
 * 备注：		现E2prom存储芯片大小为:16Kbit = 2KByte,故地址范围是:0x00000000 - 0x000007ff
*********************************************/
int E2prom_Read(u32 StartAddr, u8 *buf, u32 Bytes);

/*
 *
 * 应用程序操作E2prom接口
 *
 * */

/*********************************************
 * 函数名：			E2prom写操作
 * 输入参数：		StartAddr  起始地址
 * 					Bytes      写字节数
 * 					buf        数据保存区
 * 返回值 :			0   - 写失败
 * 					-1  - 参数不正确
 * 					x   - 写成功字节数
 * 备注：			APP操作地址范围是:0x00000000 - 0x000003ff
*********************************************/
int E2prom_App_Write(u32 StartAddr, u8 *buf, u32 Bytes);

/*********************************************
 * 函数名：			E2prom读操作
 * 输入参数：		StartAddr  起始地址
 * 					Bytes      读字节数
 * 					buf        数据保存区
 * 返回值 :			0   - 读失败
 * 					-1  - 参数不正确
 * 					x   - 读成功字节数
 * 备注：			APP操作地址范围是:0x00000000 - 0x000003ff
*********************************************/
int E2prom_App_Read(u32 StartAddr, u8 *buf, u32 Bytes);

#ifdef __cplusplus
}
#endif

#endif
