#ifndef _USB_HOST_H
#define _USB_HOST_H

#ifdef __cplusplus
extern "C" {
#endif


/*********************************************
 * 函数名：		int UsbHostStop(void);
 * 主要功能：	停止使用USB Host,并释放相关资源
 * 参数：
 * 返回值：		0 ：成功		-1 ：失败
*********************************************/
int UsbHostStop(void);


/*********************************************
 * 函数名：		int UDiskScan(void);
 * 主要功能：	扫描U盘设备
 * 参数：
 * 返回值：		1 - 成功扫描到U盘设备
 * 				0 - 没有扫描到U盘设备
 * 注意:			可配合使用UsbPortDetect方法，实现USB热拔插功能
*********************************************/
int UDiskScan(void);


/*********************************************
 * 函数名：		int UsbKbdScan(void);
 * 主要功能：	扫描USB键盘设备
 * 参数：
 * 返回值：		1 - 成功扫描到USB键盘设备
 * 				0 - 没有扫描到USB键盘设备
 * 注意:			可配合使用UsbPortDetect方法，实现USB热拔插功能
*********************************************/
int UsbKbdScan(void);


/*********************************************
 * 函数名：		u8 UsbKbdRecv(void);
 * 主要功能：	获取USB键盘按键值
 * 参数：		无
 * 返回值：		键盘键值
*********************************************/
unsigned char UsbKbdRecv(void);


/*********************************************
 * 函数名：		int UsbPortDetect(void);
 * 主要功能：	检测USB端口,可通过此函数实现USB设备热拔插功能
 * 参数：		无
 * 返回值：		1 - USB端口产生变化
 *    			0 - USB端口没变化
*********************************************/
int UsbPortDetect(void);

#ifdef __cplusplus
}
#endif

#endif
