/*
 * lcdlib.h
 *
 *  Created on: 2013-12-27
 *      Author: Administrator
 */

#ifndef LCDLIB_H_
#define LCDLIB_H_
#endif /* LCDLIB_H_ */

#include 	"adt_datatype.h"

/*
*********************************************************************************************************
*                      					 分辨率及刷新频率
*********************************************************************************************************
*/
enum Resolutions{
	E_Resolution_640_480P,		// 640  x  480  @ 60Hz
	E_Resolution_640_480H, 		// 640  x  480  @ 75Hz
	E_Resolution_800_480P,		// 800  x  480  @ 60Hz
	E_Resolution_800_600L,		// 800  x  600  @ 40Hz
	E_Resolution_800_600P,		// 800  x  600  @ 60Hz
	E_Resolution_800_600H, 		// 800  x  600  @ 75Hz
	E_Resolution_1024_768P, 	// 1024 x  768  @ 60Hz
	E_Resolution_1280_720P, 	// 1280 x  720  @ 60Hz
	E_Resolution_MAX
};


/*
*********************************************************************************************************
*
*                                       	行场信号
*
*********************************************************************************************************
*/
enum VideoParameters{
	E_Clk,								// Pixel Clock required for the given resolution
	HS_TA,HS_T1,HS_T2,HS_T3,HS_T4,
	VS_TA,VS_T1,VS_T2,VS_T3,VS_T4,
	E_VParam_MAX
};

/**
 * ********************************************************************************************************
 * 												函数定义
 * ********************************************************************************************************
 **/


/* @@ InitXMS
 *    内部资源加载
 * */
void	InitXMS(void);

/* @@ InitHzk
 *   加载中文字库
 *
 *  返回值 : 1-HZK16加载成功    2- HZK24加载成功   3-HZK16、HZK24全部加载成功     0-失败
 *
 *  注意:调用此函数初始化中文件字库时，必须先挂载FAT文件系统分区1
 * */
int   	InitHzk(void);

/* *
 * -----------------------------------------------------------------------------------
 * 函    数  名：
 * 主要功能:
 * 输入参数:
 * 输出参数:
 * 返   回  值:
 * 创建时间:  2014-02-11
 * 注意事项:
 * -----------------------------------------------------------------------------------
 * */
//	int Lcd_Init(int E_id);
int Lcd_Init(const unsigned int Param[E_VParam_MAX]);

/* *
 * -----------------------------------------------------------------------------------
 * 函    数  名：
 * 主要功能:
 * 输入参数:
 * 输出参数:
 * 返   回  值:
 * 创建时间:  2014-02-11
 * 注意事项:
 * -----------------------------------------------------------------------------------
 * */
	int	Lcd_Power(int value);

	void 	Lcd_PutPixel(U32 x,U32 y,U32 c);
	int 	Lcd_GetPixel(U32 x,U32 y,U32 *c);




