#ifndef _TOUCH_H_
#define _TOUCH_H_

#ifdef __cplusplus
extern "C" {
#endif

#define Touch_Check 	Touch_IsPress


/*********************************************
 * 函数名：			int Touch_Init(void);
 * 主要功能：		触摸屏初始化，其中建立了 Touch_Task
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			0 、成功           -1、失败
 * 注意事项 :		无
*********************************************/
int Touch_Init(void);

/*********************************************
 * 函数名：			int Touch_IsPress(void);
 * 主要功能：		判断触摸是否释放
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			1 、未释放下		0、 已释放
 * 注意事项 :		无
*********************************************/
int Touch_IsPress(void);

/*********************************************
 * 函数名：			int Touch_GetXY(s16 *x, s16 *y);
 * 主要功能：		获取当前触摸的 X,Y 位置坐标
 * 输入参数：		无
 * 输出参数:
 * 					x： 获取得到的 x 坐标
 * 					y： 获取得到的 y 坐标
 * 返回值 :			1 正确	0 错误
 * 注意事项 :		获取之前必须先判断触摸是否有按下
*********************************************/
int Touch_GetXY(s16 *x, s16 *y);

/*********************************************
 * 函数名：			int Touch_GetTouchArray(u16 array[]);
 * 主要功能：		获取触摸屏边界
 * 输入参数：		无
 * 输出参数：
 * 					array[0]： 获取得到pxmin
 * 					array[1]： 获取得到pymin
 * 					array[1]： 获取得到pxmax
 * 					array[1]： 获取得到pymax
 * 返回值 :			0 、正确		1、错误
 * 注意事项 :		无
*********************************************/
int Touch_GetTouchArray(u16 array[]);

/*********************************************
 * 函数名：			int Touch_SetTouchArray(u16 array[]);
 * 主要功能：		设置触摸屏边界
 * 输入参数：		array[0]： 获取得到pxmin
 * 					array[1]： 获取得到pymin
 * 					array[1]： 获取得到pxmax
 * 					array[1]： 获取得到pymax
 * 输出参数：		无
 *
 * 返回值 :			0 、正确            1、错误
 * 注意事项 :		无
*********************************************/
int Touch_SetTouchArray(u16 array[]);

/*********************************************
 * 函数名：			int Touch_SetTpMode(u16 mode);
 * 主要功能：		触摸屏模式,xy有否相反
 * 输入参数：		mode:	0 、正常            1、反向
 * 输出参数：		无
 *
 * 返回值 :			0 、正确            1、错误
 * 注意事项 :		无
*********************************************/
int Touch_SetTpMode(u16 mode);

/*********************************************
  * 函数名：			void Touch_SetTimeout(int tick);
 * 主要功能：		超时时间设置。默认为100
 * 输入参数：		tick:	超时时间
 * 输出参数：		无
 *
 * 返回值 :			无
 * 注意事项 :		无
*********************************************/
void Touch_SetTimeout(int tick);


/*********************************************
 * 函数名：			void Touch_GetOriginalXY(s16 *x, s16 *y);
 * 主要功能：		获取原始坐标值
 * 输入参数：		无
 * 输出参数:
 * 					x： 获取得到的 x 坐标
 * 					y： 获取得到的 y 坐标
 *
 * 返回值 :			无
 * 注意事项 :		获取之前必须先判断触摸是否有按下
*********************************************/
void Touch_GetOriginalXY(s16 *x, s16 *y);




#ifdef __cplusplus
}
#endif

#endif
