#ifndef __KEY_H__
#define __KEY_H__

#ifdef __cplusplus
extern "C" {
#endif


#include "adt_datatype.h"

/* 对应面板指示灯 STOP/RUN */
#define PANEL_LED_STOP		0x01
#define PANEL_LED_RUN		0x02

/* 表示面板指示灯 开/关 */
#define PANEL_LED_OFF		0x00
#define PANEL_LED_ON		0x01

/*RPB06手持器通信模式*/
#define	ModbusToCustom		1
#define	CustomToModbus		2

#define GetKey_Bot key_get


/*********************************************
 * 函数名：			int key_init(void);
 * 主要功能：		初始化按键
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			0 、成功           -1、失败
 * 注意事项 :		无
*********************************************/
int key_init(void);


/*********************************************
 * 函数名：			int key_get_err(void);
 * 主要功能：		错误计数值读取
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			串口通信错误次数计数值
 * 注意事项 :		无
*********************************************/
int key_get_err(void);


/*********************************************
 * 函数名：			void key_err_clr(void);
 * 主要功能：		错误计数值清除
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			串口通信错误次数计数值清除函数
 * 注意事项 :		无
*********************************************/
void key_err_clr(void);


/*********************************************
 * 函数名：			INT16U key_mget(int key);
 * 主要功能：		多按键支持（49系列）
 * 输入参数：		key 键值 或 按键号
 * 输出参数 :		无
 * 返回值 :
 * 					1)  key为 按键号时（-1 ~ -3） 返回值为相应1-3个的按键值
 * 					2)  key为其它值时，判断参数是否与按键值相同。1：表示相符 0：表示不符
 * 注意事项 :		无
*********************************************/
INT16U key_mget(int key);


/*********************************************
 * 函数名：			INT16U key_get(void);
 * 主要功能：		按键值读取
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			键值
 * 注意事项 :		无
*********************************************/
INT16U key_get(void);


/*********************************************
 * 函数名：			INT16U da_get(void);
 * 主要功能：		TH机测试旋钮 读取
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			DA值
 * 注意事项 :		无
*********************************************/
INT16U da_get(void);


/*********************************************
 * 函数名：			INT16U key_set_led(int num, int stat);
 * 主要功能：		按键灯控制
 * 输入参数：
 * 					num    ： 表示指示灯号
 * 					stat   ：表示打开或关闭指示灯
 * 输出参数 :		无
 * 返回值 :			0-成功    1-失败
 * 注意事项 :		无
*********************************************/
INT16U key_set_led(int num, int stat);


/*********************************************
 * 函数名：			INT16U special_key_get(void);
 * 主要功能：		特殊功能按键获取，如急停/钥匙天关等...
 * 输入参数：
 * 					num    ： 表示指示灯号
 * 					stat   ：表示打开或关闭指示灯
 * 输出参数 :		无
 * 返回值 :
 * 					机型（6001）		位  	|	0		|    1		|2 - 3		| 4-15 	|
 * 					描述 				|急停开关	|安全开关	|钥匙开关 	| 保留	|
 * 					机型（RPB07）	位  	|  0  		|	1-2  	| 3-15	|
 * 					描述 				||保留	  	|	使能开关	| 保留 	|
 *
 * 注意事项 :		无
*********************************************/
INT16U special_key_get(void);



/*********************************************
 * 函数名：			int set_panel_led(int num, int sta);
 * 主要功能：		设置指示灯状态函数
 * 输入参数：
 * 					num		指示灯号		1：第一个指示灯状态；2：第二个指示灯状态 3：第三个指示灯状态  4：以此类推
 * 					sta		指示灯状态	1：表示点亮 ；  其他：表示熄灭。
 * 输出参数 :		无
 * 返回值 :			0-成功    1-失败
 * 注意事项 :		1、此函数可以设置指示灯的状态，6861主板为面板只是灯，1600E上为状态指示灯。具体含义自定。
 * 					2、点亮和熄灭可能不同硬件有差别，到时自行翻转即可
*********************************************/
int set_panel_led(int num, int sta);


/*
 * 以下是RPB06手持器通信接口
 * */
/*********************************************
 * 函数名：			int ChangeModeForHandbox(int mode);
 * 主要功能：		RPB06手持器通信切换
 * 输入参数：		mode	通信模式
 * 					1：ModbusToCustom；		2：CustomToModbus
 * 输出参数 :		无
 * 返回值 :			0-成功		-1-失败
 * 注意事项 :		无
*********************************************/
int ChangeModeForHandbox(int mode);

/*********************************************
 * 函数名：			int Comm_TouchIsPress();
 * 主要功能：		判断触摸是否释放（RPB06手持器）
 * 输入参数：		无
 * 输出参数 :		无
 * 返回值 :			1 、未释放下		0、 已释放
 * 注意事项 :		无
*********************************************/
int Comm_TouchIsPress();

/*********************************************
 * 函数名：			int Touch_GetXY(s16 *x, s16 *y);
 * 主要功能：		获取当前触摸的 X,Y 位置坐标（RPB06手持器）
 * 输入参数：		无
 * 输出参数:
 * 					x： 获取得到的 x 坐标
 * 					y： 获取得到的 y 坐标
 * 返回值 :			无
 * 注意事项 :		获取之前必须先判断触摸是否有按下
*********************************************/
void Comm_TouchGetXY(s16 *x,s16 *y);

/*********************************************
 * 函数名：			int SendCustomCmd(u8 type, u16 val, u8 result);
 * 主要功能：		发送数据（RPB06手持器）
 * 输入参数：
 * 					type	协议类型
 * 					val		数据
 * 					result	校验值
 * 输出参数 :		无
 * 返回值 :			0-成功		-1-失败
 * 注意事项 :		要知道RPB06手持器协议类型和校验值
*********************************************/
int SendCustomCmd(u8 type, u16 val, u8 result);

#ifdef __cplusplus
}
#endif

#endif
